In [1]:
from bs4 import BeautifulSoup
import pandas as pd
import requests

In [2]:
page = requests.get('https://sos.ga.gov/elections/election_results/2010_0810/0030901.htm')
soup = BeautifulSoup(page.text, 'html.parser')

In [3]:
table = soup.find_all("table")[2]

In [4]:
df = pd.read_html(str(table), flavor='bs4')

In [5]:
df = df[1]

In [6]:
df.shape

(18, 8)

In [7]:
df.head(5)

         0     1               2                3               4   5   6   7
0      NaN   NaN  Graves  41,878  Hawkins  33,975  Totals  75,853 NaN NaN NaN
1      NaN   NaN           55.2%            44.8%          100.0% NaN NaN NaN
2   County   PPR             NaN              NaN             NaN NaN NaN NaN
3  CATOOSA  100%            1989             1450            3439 NaN NaN NaN
4     DADE  100%             464              325             789 NaN NaN NaN

In [8]:
df = df[3:]

In [9]:
df.head(5)

         0     1     2     3      4   5   6   7
3  CATOOSA  100%  1989  1450   3439 NaN NaN NaN
4     DADE  100%   464   325    789 NaN NaN NaN
5   DAWSON  100%  1695  1538   3233 NaN NaN NaN
6   FANNIN  100%  1521  1133   2654 NaN NaN NaN
7  FORSYTH  100%  9772  6002  15774 NaN NaN NaN

In [10]:
df = df[df.columns[[0,2,3]]]

In [11]:
df.head(5)

         0     2     3
3  CATOOSA  1989  1450
4     DADE   464   325
5   DAWSON  1695  1538
6   FANNIN  1521  1133
7  FORSYTH  9772  6002

In [12]:
df.columns = ['county', 'Tom Graves', 'Lee Hawkins']

In [13]:
df.tail(5)

       county Tom Graves Lee Hawkins
13    PICKENS       2739        1250
14      UNION       1352        1089
15     WALKER       1813        1158
16      WHITE       2020        1716
17  WHITFIELD       3538        2806

In [14]:
df = df.melt(id_vars=['county'])

In [15]:
df.columns = ['county', 'candidate', 'votes']

In [16]:
df.head()

    county   candidate votes
0  CATOOSA  Tom Graves  1989
1     DADE  Tom Graves   464
2   DAWSON  Tom Graves  1695
3   FANNIN  Tom Graves  1521
4  FORSYTH  Tom Graves  9772

In [17]:
df['votes'] = df['votes'].astype(int)

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 3 columns):
county       30 non-null object
candidate    30 non-null object
votes        30 non-null int64
dtypes: int64(1), object(2)
memory usage: 800.0+ bytes

In [19]:
df['office'] = 'U.S. Representative'

In [20]:
df['district'] = '9'

In [21]:
df['party'] = 'Republican'

In [22]:
df.groupby(['candidate', 'party'])['votes'].sum()

candidate    party
Lee Hawkins  Republican    33975
Tom Graves   Republican    41878
Name: votes, dtype: int64

In [23]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].head()

    county               office district       party   candidate  votes
0  CATOOSA  U.S. Representative        9  Republican  Tom Graves   1989
1     DADE  U.S. Representative        9  Republican  Tom Graves    464
2   DAWSON  U.S. Representative        9  Republican  Tom Graves   1695
3   FANNIN  U.S. Representative        9  Republican  Tom Graves   1521
4  FORSYTH  U.S. Representative        9  Republican  Tom Graves   9772

In [24]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].to_clipboard(index=False, sep=',')